token1 = "679504899:AAGcjC6nfA7t7Yvy0wQebo95Pk9LDmFfCW0"
chanel = 307594259
token = "629054506:AAFtZnTQS8v5RbPWA0orN6TRRYli1IxuSB4"

# ---------- NAMES ----------------------
name_unreal = "Выбери квест из списка."
name_game1 = "4 билборда на границе Подлипок, Королёв"
name_game2 = "Спорт 22"
name_game3 = "Ночной"

# ---------- FOR COMMANDS ----------------
start_message = "Это бот с отличными квестами! Попробуй пройти все!\n" \
                "Также ты можешь отследить свои результаты по набранным баллам. Вот только баллы тебе пока " \
                "не скажем :)\n" \
                "Если хочешь получить информацию по командам, " \
                "которые есть у бота, набери /help\n\n" \
                "Ну, погнали! Выбирай пункт меню или команду."
help_message = "Вот команды, которые есть у бота:\n" \
               "/go - выбрать квест\n" \
               "/feedback - оставить свой отзыв\n" \
               "/rules - правила прохождения квестов\n" \
               "/support - поддержать проект\n" \
               "/rating - посмотреть рейтинг участников\n\n" \
               "Рейтинг формируется на основе количества пройденных квестов, использованных подсказок и " \
               "времени, затраченного на прохождение."
rules_message = "Пока особых правил нет, просто советуем честно выполнять задания"
support_message = "О, помочь хочешь? Это прикольненько) Но погоди, пока еще рано. Лучше напиши отзыв."
rating_message = "Не торопись, мы еще не настолько сильно раскрутились."
go_message = "Выбирай квест."
feedback_message = "Нам очень важно узнать ваше мнение по поводу данного проекта!" \
                   "\nБудем рады любой критике, пожеланиям и предложениям."
feedback_message_2 = "Спасибо за отзыв!"

# ---------- FOR QWERTY IN QUESTS ------------------
button_hint = "Подсказка 🙃"
button_play = "В игру!"
button_replay = "Начать заново 🌀"
button_change_choice = "Выбрать другой квест 🏄"
button_repeat_question = "Повторить вопрос 🔄"
button_back = "🔙 Назад"
button_choose_quest = "Выбрать квест"
button_feedback = "Оставить отзыв"
button_info = "Информация"
button_support = "Поддержка проекта"
inline_button_yes_to_reply = "да_подтверждение1"
inline_button_no_to_reply = "нет_подтверждение1"

# ---------- PHRASES FOR WRONG ANSWER --------------
_1_wa = "No"
_2_wa = "NOO"
_3_wa = "Ну нет же."
wa = ["No", "Неа", "Это неверно", "Неправильно. Подумай еще.",
      "Нет.", "Это не то.", "Давай еще версии.", "Совсем нет", "Ну как же? Нет, конечно.",
      "Неа. Попробуй еще раз"]

# - ANOTHER PHRASES -
to_reply_quest = "Начнем квест заново"
answering_before_reply_quest = "Точно начинаем квест заново?"
after_stopping = "Так-с, на чем мы тут остановились... А, вот!"
in_development = "Сорян, еще в разработке. Выбери что-то другое (:"
in_main_menu = "Вот главное меню"
unreal_menu_point = "Выбери пункт меню"
after_redacting_message = "НЕ ВЗДУМАЙ МЕНЯ ПЕРЕХИТРИТЬ"
