# ---------- FOR GAME 1 ------------------

# - QUESTIONS -
_1_question = "Сколько ножек у нормального стула?"
_2_question = "Изучи то, что есть под билбордами. Обращай внимание на красный цвет."
_3_question = "Когда найдешь этот гараж, " \
            "напиши, что необычного заметишь около него."
_4_question = "Сколько лет в году?"
_5_question = "А для этого назови мне, Милдред, номер гаража, который идет после 246. И нет, это не 247!"
_6_question = "Помнишь, кто оказался убийцей?"
_7_question = "question #6"
_8_question = "question #7"
_9_question = "question #8"

# - PHRASES -
"""ОБЯЗАТЕЛЬНО РАЗБИТЬ ОТВЕТНЫЕ ФРАЗЫ И ВОПРОСЫ В РАЗНЫЕ ОБЪЕКТЫ"""
_1_phrase = "Идея квеста взята из фильма: 3 билборда на границе Эббинга, Миссури. " \
            "Вы будете в роли главной героини фильма - Милдред. Ваша задача - " \
            "найти и узнать, что случилось с вашей дочерью. \n" \
            "Начало прохождения у памятника С.П.Королёва на проспекте Королёва. Рекомендуем " \
            "проходить все точки последовательно вместе с героиней."
_2_phrase = "И снова привет, Милдред. Это я, Уиллоуби. Мог бы долго с тобой говорить, да только все бесполезно. " \
            "У нас в участке круглые сутки разговоры про эти билборды. А я уже раз 20 объяснял тебе, " \
            "что по тем данным, которые у нас есть, мы не можем найти твою дочь, понимаешь? Их недостаточно, " \
            "Милдред. Так что давай поступим так: я верну тебе деньги за первый месяц аренды, которые ты заплатила, " \
            "но мы их снимем, потому что мы правда сделали все, что могли. \n\n" \
            "В смысле, НЕТ? Хотя чего еще можно было ожидать от тебя? \n" \
            "Знаешь, у меня есть одна небольшая идея. Давай ты сама посмотришь на все то, что у нас " \
            "есть, а? Возможно после этого ты захочешь изменить свое мнение. Пойдем. \n\n" \
            "Эти твои билборды стоят около весьма интересного места, Милдред." \
            "Там ты найдешь забавный след, который оставил преступник."
_3_phrase = "Отлииично! Вероятно, когда-то ты захочешь стать детективом, но сейчас идем дальше. \n" \
            "Мы проверили и нашли, что эти инициалы соответствуют лишь одному человеку в нашем городе. И знаешь, " \
            "мы даже нашли его гараж тут неподалеку. Этот гараж прямо связан с нашим годом. Да, просто с годом."
_4_phrase = "О, чудно. Вот только пока что нам это ничего не дает. Или... В общем, не суть. Версий много, только " \
            "адекватных среди них нет. Кстати, насчет адекватности и лет. Вчера услышал забавную загадку от Диксона."
_5_phrase = "Да-да. Знаешь, я почти уверен, что эта загадка от его мамы. Ну да ладно. Вернемся к делу. \n" \
            "Последний раз из гаража выезжали давно. Но местные говорят, что видели проезжающую машину в день пропажи " \
            "твоей дочери. Она поехала еще дальше вдоль гаражей по дороге. И у меня огромное желание того, чтобы " \
            "ты эту дорогу прошла и убедилась в том, что никаких улик там нет. "
_6_phrase = "А теперь пройди еще буквально пару шагов, чтобы увидеть эту большую площадь между гаражами. Нашла? " \
            "Именно тут остановился наш подозреваемый. Но есть одна проблема. В день пропажи твоей дочери у нас был " \
            "переполох во всем городе. Вспомни, утром наш банк решили ограбить и мы немедленно принялись искать вора. " \
            "\nДиректор банка тогда был на курорте с любовницей, его жена дома, а половина работников в отпуске. " \
            "Охранник мало что помнит, так как его вырубила резко открывшаяся дверь запасного выхода, когда " \
            "он делал обход по банку." \
            "А по описанию посетителей банка виновник был довольно невысокий, но сильный. Одет был в черное и " \
            "нес собой биту. "
_7_phrase = "Именно! Мы и не сразу вспомнили, что запасные выходы по технике безопасности открываются наружу. \n" \
            "Так вот, я это к тому, что до того, как мы это поняли, мы проверяли всех подряд в городе. " \
            "И в том числе и его. Только ничего у него тогда не нашли. Ни денег, ни следов того, что он мог " \
            "кого-то похитить. У нас парни хорошие: сразу бы заметили. Так что эта версия обрывается. Дальше у нас " \
            "не так уж много вариантов. Помнишь, где ее видели в последний раз? Вот тут мнения людей расходятся. \n\n" \
            "По фотографии дочери, кто-то говорит, что видел ее, когда она собиралась уезжать из города, а кто-то " \
            "утверждает, что сидела с друзьями в кафе. Как тебе, Милдред? Веришь ли ты в то, что твоя дочь сама " \
            "тебя оставила и уехала из города? Либо мы пойдем с тобой прорабатывать другую версию?"

# - HINTS -
_1_hint = "Ну посчитай."
_2_hint = "Милдред, под ними - значит, поищи интересные надписи под мостом. Вроде же и так можно было догадаться. " \
          "(ответ: К.С.)"
_3_hint = "Подумай про количесвто дней в году, если до сих пор не нашла этот несчастный гараж. " \
          "(ответ: Сияние) (Я просто пока не знаю, что именно укажем с этим гаражом)"
_4_hint = "Ну тут игра слов, подумай немножко."
_5_hint = "Просто иди вдоль гаражей, какие тут у тебя проблемы? " \
          "(ответ: 246а)"
_6_hint = "Вспомни, Милдред. На самом деле, простой вопрос."
_7_hint = "Ну посчитай."
_8_hint = "Ну посчитай."

# - RIGHT ANSWERS -
_1_right_answer = ["четыре", "4"]
_2_right_answer = ["кс", "к.с."]
_3_right_answer = ["сияние"]
_4_right_answer = ["1", "одно"]
_5_right_answer = ["246а", "246 а"]
_6_right_answer = ["охранник"]
_7_right_answer = ["охранник"]
_8_right_answer = ["охранник"]
_9_right_answer = ["охранник"]

questions = [_1_question, _2_question, _3_question, _4_question, _5_question, _6_question, _7_question]
phrases = [_1_phrase, _2_phrase, _3_phrase, _4_phrase, _5_phrase, _6_phrase, _7_phrase]
hints = [_1_hint, _2_hint, _3_hint, _4_hint, _5_hint, _6_hint, _7_hint, _8_hint]
answers = [_1_right_answer, _2_right_answer, _3_right_answer, _4_right_answer, _5_right_answer, _6_right_answer,
           _7_right_answer]
